---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FabricationServiceSettings
source: html/cd1e1033-bf13-4888-f310-c2e960fe56ba.htm
---
# FabricationServiceSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.